question-3/app/views/users/show.html.haml

              Tagged users:
            - photo.tags.each do |tag|
---
SELECT  "tags".* FROM "tags" WHERE "tags"."photo_id" = ?  ORDER BY "tags"."id" DESC LIMIT 1  [["photo_id", 2]]

            Comments:
            - photo.comments.each do |c|
---
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 2]]