question-2/app/views/users/show.html.haml

SELECT "tags".* FROM "tags" WHERE "tags"."photo_id" = ?  [["photo_id", 2]]
---
              = f.submit "Tag User"
            - photo.tags.each do |tag|