question-3/app/controllers/follows_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "follows" ("follower_id", "followee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 6], ["followee_id", 1], ["created_at", "2022-11-29 17:28:56.938689"], ["updated_at", "2022-11-29 17:28:56.938689"]]
---
	def create
		# followee means that we follow that user
		@followee = User.find(params[:followee_id])
		# follow functionality
		@follow = Follow.create(follower_id: params[:user_id], followee_id: params[:followee_id])