source files/app/views/users/show.html.haml

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 1]]
---
.row
  - @user.photos.each  do |photo|
    .well.col-sm-4

SELECT "tags".* FROM "tags" WHERE "tags"."photo_id" = ?  [["photo_id", 2]]
---
        = f.submit "Tag User"
      - photo.tags.each do |tag|