question-bonus/app/controllers/comments_controller.rb

  def create
    @comment = Comment.create(photo_id: params[:photo_id], user_id: params[:user_id], context: params[:comment][:context])
---
INSERT INTO "comments" ("photo_id", "user_id", "context", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["photo_id", 2], ["user_id", 1], ["context", "This is so cool"], ["created_at", "2022-11-29 22:58:59.074658"], ["updated_at", "2022-11-29 22:58:59.074658"]]