question-bonus/app/controllers/photos_controller.rb

  def create
    @user = User.find(params[:user_id])
    if params[:photo][:image] == nil
      flash[:alert] = "Please upload a photo."
      redirect_to :back
    elsif params[:photo][:title] == ""
      flash[:alert] = "You forgot to add a title!"
      redirect_to :back
    else
    @photo = Photo.create(photo_params)
      @photo.user_id = @user.id
      @photo.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "photos" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "g"], ["created_at", "2022-11-28 17:22:35.717463"], ["updated_at", "2022-11-28 17:22:35.717463"]]
UPDATE "photos" SET "user_id" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["user_id", 1], ["updated_at", "2022-11-28 15:13:18.705730"], ["id", 2]]

  def destroy
    @photo = Photo.find(params[:photo_id])
    @photo.destroy
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 2]]